{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\NHANES_NFL_MORTALITY_PAPER\OUTPUT\FIGURE1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 2 Nov 2022, 07:30:25
{txt}
{com}. 
. 
. 
. ******************************STEP 11: SAMPLE SELECTION FLOWCHART AND 2-STAGE HECKMAN SELECTION: MONDAY************
. 
. 
. **////////////GENERATE FINAL SAMPLE SELECTION VARIABLE/////////////////////
. use  NHANES_NFL_MORTALITY_PAPER,clear
{txt}
{com}. 
. *************SAMPLE 20+********************
. 
. capture drop sample20plus
{txt}
{com}. gen sample20plus=.
{txt}(10,175 missing values generated)

{com}. replace sample20plus=1 if AGE>=20 & AGE~=.
{txt}(5,769 real changes made)

{com}. replace sample20plus=0 if sample20plus~=1 & AGE~=.
{txt}(4,406 real changes made)

{com}. 
. 
. *************FINAL SAMPLE*****************
. capture drop SAMPLE_FINAL
{txt}
{com}. gen SAMPLE_FINAL=.
{txt}(10,175 missing values generated)

{com}. replace SAMPLE_FINAL=1 if LNNFL~=. 
{txt}(2,071 real changes made)

{com}. replace SAMPLE_FINAL=0 if SAMPLE_FINAL~=1
{txt}(8,104 real changes made)

{com}. 
. 
. tab SAMPLE_FINAL

{txt}SAMPLE_FINA {c |}
          L {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      8,104       79.65       79.65
{txt}          1 {c |}{res}      2,071       20.35      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,175      100.00
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
NHANES_NFL_MORTALITY_PAPER.dta{rm}
saved
{p_end}

{com}. 
. 
. *************FINAL SAMPLE2, WITH COMPLETE COVARIATES*****
. 
. 
. **GET FROM MED4WAY ANALYSIS**
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
NHANES_NFL_MORTALITY_PAPER.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. **///////////////CREATE INVERSE MILLS RATIO///////////////////////////////
. 
. 
. xi:probit SAMPLE_FINAL AGE SEX i.RACE_ETHN if  RIDAGEYR>=20
{txt}i.RACE_ETHN{col 19}_IRACE_ETHN_0-3{col 39}(naturally coded; _IRACE_ETHN_0 omitted)

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-3766.1966}  
Iteration 1:{space 3}log likelihood = {res:-3732.2593}  
Iteration 2:{space 3}log likelihood = {res:-3732.2474}  
Iteration 3:{space 3}log likelihood = {res:-3732.2474}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:5,769}
{txt}{col 57}{lalign 13:LR chi2({res:5})}{col 70} = {res}{ralign 6:67.90}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-3732.2474}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0090}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} SAMPLE_FINAL{col 15}{c |} Coefficient{col 27}  Std. err.{col 39}      z{col 47}   P>|z|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}AGE {c |}{col 15}{res}{space 2}-.0072819{col 27}{space 2} .0009889{col 38}{space 1}   -7.36{col 47}{space 3}0.000{col 55}{space 4}-.0092201{col 68}{space 3}-.0053436
{txt}{space 10}SEX {c |}{col 15}{res}{space 2} .0005022{col 27}{space 2}  .033964{col 38}{space 1}    0.01{col 47}{space 3}0.988{col 55}{space 4} -.066066{col 68}{space 3} .0670704
{txt}_IRACE_ETHN_1 {c |}{col 15}{res}{space 2}-.1561952{col 27}{space 2} .0461589{col 38}{space 1}   -3.38{col 47}{space 3}0.001{col 55}{space 4} -.246665{col 68}{space 3}-.0657254
{txt}_IRACE_ETHN_2 {c |}{col 15}{res}{space 2} .0113419{col 27}{space 2}  .044252{col 38}{space 1}    0.26{col 47}{space 3}0.798{col 55}{space 4}-.0753905{col 68}{space 3} .0980743
{txt}_IRACE_ETHN_3 {c |}{col 15}{res}{space 2}-.0712786{col 27}{space 2} .0514953{col 38}{space 1}   -1.38{col 47}{space 3}0.166{col 55}{space 4}-.1722076{col 68}{space 3} .0296504
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} .0314909{col 27}{space 2} .0760259{col 38}{space 1}    0.41{col 47}{space 3}0.679{col 55}{space 4}-.1175171{col 68}{space 3}  .180499
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. capture drop p1
{txt}
{com}. predict p1, xb
{txt}
{com}. 
. capture drop phi
{txt}
{com}. capture drop caphi
{txt}
{com}. capture drop invmills
{txt}
{com}. 
. gen phi=(1/sqrt(2*_pi))*exp(-(p1^2/2))
{txt}
{com}. 
. egen caphi=std(p1)
{txt}
{com}. 
. capture drop invmills
{txt}
{com}. gen invmills=phi/caphi
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
NHANES_NFL_MORTALITY_PAPER.dta{rm}
saved
{p_end}

{com}. 
. 
. /*SURVEY COMMANDS*/
. 
. sum WTSSNH2Y 

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}WTSSNH2Y {c |}{res}      2,085    101916.6    72591.71          0     384148
{txt}
{com}. 
. svyset [pweight=WTSSNH2Y], strata(SDMVSTRA) psu(SDMVPSU)

{txt}Sampling weights:{col 19}{res}WTSSNH2Y
             {txt}VCE:{col 19}{res}linearized
     {txt}Single unit:{col 19}{res}missing
        {txt}Strata 1:{col 19}{res}SDMVSTRA
 {txt}Sampling unit 1:{col 19}{res}SDMVPSU
           {txt}FPC 1:{col 19}<zero>
{p2colreset}{...}

{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
NHANES_NFL_MORTALITY_PAPER.dta{rm}
saved
{p_end}

{com}. 
. *******************AGE AT ALL-CAUSE DEATH****
. 
. capture drop AGE_DEATH
{txt}
{com}. gen AGE_DEATH=AGE+PERMTH_EXM/12
{txt}(4,262 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
NHANES_NFL_MORTALITY_PAPER.dta{rm}
saved
{p_end}

{com}. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}